{
    "movies": [
        {
            "movie_id": "m1",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "A Start Is Born",
            "years": "2018",
            "rating": "8.3",
            "category": "Roman, Musik",
            "overview": "Seorang bintang musik country yang karirnya mulai memudar, Jackson Maine (Bradley Cooper) menemukan sebuah talenta yang sangat berbakat di dalam diri dari seorang musisi muda bernama Ally (Lady Gaga). Maine berhasil mengorbitkan Ally menjadi seorang bintang muda yang menjanjikan. Namun keduanya terlibat hubungan yang lebih jauh dari sekedar mentor dan anak didik. Seiring dengan meroketnya karir dari Ally dan dirinya, Maine mengalami dilema mengenai masalah ini.",
            "release": "19 Oktober 2018"
        },
        {
            "movie_id": "m2",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Alita: Battle Angel",
            "years": "2019",
            "rating": "7.1",
            "category": "Aksi, Cerita Fiksi, Petualangan",
            "overview": "Ketika Alita terbangun tanpa ingatan tentang siapa dia di dunia masa depan yang tidak dia kenal, dia ditangkap oleh Ido, seorang dokter yang penuh kasih yang menyadari bahwa di suatu tempat dalam cangkang cyborg yang ditinggalkan ini adalah hati dan jiwa seorang wanita muda dengan luar biasa.",
            "release": "14 Februari 2019"
        },
        {
            "movie_id": "m3",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Aquaman",
            "years": "2018",
            "rating": "6.9",
            "category": "Aksi, Petualangan, Fantasi",
            "overview": "Dulunya rumah bagi peradaban paling maju di Bumi, Atlantis sekarang menjadi kerajaan bawah air yang diperintah oleh Raja Orm yang haus kekuasaan. Dengan pasukan besar yang dimilikinya, Orm berencana untuk menaklukkan orang-orang samudra yang tersisa dan kemudian dunia permukaan. Yang menghalangi jalannya adalah Arthur Curry, saudara setengah manusia Orm, saudara setengah Atlantis dan pewaris sejati takhta.",
            "release": "21 Desember 2018"
        },
        {
            "movie_id": "m4",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Bohemian Rhapsody",
            "years": "2018",
            "rating": "8.0",
            "category": "Drama, Musik",
            "overview": "Penyanyi Freddie Mercury, gitaris Brian May, drummer Roger Taylor, dan gitaris bass John Deacon menggemparkan dunia musik ketika mereka membentuk band rock 'n' roll Queen pada tahun 1970. Lagu-lagu hit menjadi klasik instan. Ketika gaya hidup Mercury yang semakin liar mulai lepas kendali, Queen segera menghadapi tantangan terbesarnya - menemukan cara untuk menjaga band tetap bersama di tengah kesuksesan dan kelebihan.",
            "release": "02 November 2018"
        },
        {
            "movie_id": "m5",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Cold Persuit",
            "years": "2019",
            "rating": "5.6",
            "category": "Aksi, Kejahatan, Cerita Seru",
            "overview": "Kehidupan keluarga yang tenang dari Nels Coxman, seorang pengemudi bajak salju, berubah setelah pembunuhan putranya. Nels memulai perburuan dendam untuk Viking, raja obat bius yang dianggapnya bertanggung jawab atas pembunuhan itu, melenyapkan rekan Viking satu per satu. Saat Nels semakin dekat dengan Viking, tindakannya membawa konsekuensi yang lebih tidak terduga dan kejam, karena ia membuktikan bahwa balas dendam ada dalam eksekusi.",
            "release": "08 Februari 2019"
        },
        {
            "movie_id": "m6",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Creed II",
            "years": "2018",
            "rating": "6.9",
            "category": "Drama",
            "overview": "Antara kewajiban pribadi dan pelatihan untuk pertarungan besar berikutnya melawan lawan yang terkait dengan masa lalu keluarganya, Adonis Creed menghadapi tantangan dalam hidupnya.",
            "release": "21 November 2018"
        },
        {
            "movie_id": "m7",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "The Crimes Of Grindelwald",
            "years": "2018",
            "rating": "6.9",
            "category": "Petualangan, Fantasi, Drama",
            "overview": "Gellert Grindelwald telah melarikan diri dari penjara dan telah mulai mengumpulkan pengikut ke tujuannya — meninggikan penyihir di atas semua makhluk non-magis. Satu-satunya yang bisa menghentikannya adalah penyihir yang pernah disebutnya sebagai sahabat terdekatnya, Albus Dumbledore. Namun, Dumbledore akan perlu mencari bantuan dari penyihir yang telah menggagalkan Grindelwald sebelumnya, mantan muridnya, Newt Scamander, yang setuju untuk membantu, tidak menyadari bahaya yang ada di depan. Garis-garis digambar saat cinta dan kesetiaan diuji, bahkan di antara teman-teman dan keluarga sejati, di dunia sihir yang semakin terbagi.",
            "release": "16 November 2018"
        },
        {
            "movie_id": "m8",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Glass",
            "years": "2019",
            "rating": "6.6",
            "category": "Cerita Seru, Drama, Cerita Fiksi",
            "overview": "Dalam serangkaian pertemuan yang meningkat, mantan penjaga keamanan David Dunn menggunakan kemampuan supernaturalnya untuk melacak Kevin Wendell Crumb, seorang pria yang memiliki dua puluh empat kepribadian yang terganggu. Sementara itu, kehadiran bayangan Elijah Price muncul sebagai seorang orkestra yang menyimpan rahasia penting bagi keduanya.",
            "release": "18 Januari 2019"
        },
        {
            "movie_id": "m9",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "How To Train Your Dragon: The Hidden World",
            "years": "2019",
            "rating": "7.8",
            "category": "Animasi, Keluarga, Petualangan",
            "overview": "Ketika Hiccup memenuhi mimpinya untuk menciptakan utopia naga yang damai, penemuan Toothless 'dari pasangan yang tak teruji dan sukar ditangkap membuat Night Fury menjauh. Ketika bahaya meningkat di rumah dan pemerintahan Hiccup sebagai kepala desa diuji, baik naga dan pengendara harus membuat keputusan yang mustahil untuk menyelamatkan jenis mereka.",
            "release": "22 Februari 2019"
        },
        {
            "movie_id": "m10",
            "image": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/j8MRnCjuN7kpM8w3B5hM5mrvTaE.jpg",
            "title": "Avengers: Infinity War",
            "years": "2018",
            "rating": "8.3",
            "category": "Petualngan, Aksi, Cerita Fiksi",
            "overview": "Karena Avengers dan sekutunya terus melindungi dunia dari ancaman yang terlalu besar untuk ditangani oleh seorang pahlawan, bahaya baru telah muncul dari bayangan kosmik: Thanos. Seorang lalim penghujatan intergalaksi, tujuannya adalah untuk mengumpulkan semua enam Batu Infinity, artefak kekuatan yang tak terbayangkan, dan menggunakannya untuk menimbulkan kehendak memutar pada semua realitas. Segala sesuatu yang telah diperjuangkan oleh Avengers telah berkembang hingga saat ini - nasib Bumi dan keberadaannya sendiri tidak pernah lebih pasti.",
            "release": "27 April 2018"
        }
    ]
}